{
  "title": "Cod Piccata",
  "ingredients": {
    "Main": [
      "1.5 pounds (680g) cod",
      "3 tablespoons (27g) capers rinsed",
      "2 large lemons 8 slices and rest cut into wedges",
      "3 tablespoons minced flat-leaf Italian parsley",
      "4 cloves garlic sliced",
      "3/4 cup (97g) flour will not need all of it",
      "1 cup (240g) low-sodium chicken stock",
      "3 ounces (85g) dry white wine",
      "5 tablespoons (70g) butter unsalted, cubed, divided",
      "1/4 cup (60g) olive oil",
      "1 teaspoon Diamond Crystal Kosher salt",
      "1/4 teaspoon pepper"
    ]
  },
  "steps": [
    "Preheat oven to 325f and set a rack to the middle level.",
    "Trim any large cod fillets into approximately 6-8 inch long pieces. Pat the fillets dry and season both sides of all pieces with salt and pepper.",
    "Dredge the cod fillets in the flour and set aside on parchment paper. Save the flour for use later in the recipe.",
    "Heat a large nonstick pan to a touch less than medium heat, then add 1 tablespoon of olive oil and butter to the pan. Sear the fillets in the pan until cooked through (approximately 3-4 minutes per side) then set aside on a platter lightly tented with foil. Do not crowd the cod fillets in the pan Work in batches, using a bit more olive oil and butter as required for each batch.",
    "After all of the cod pieces have been cooked, place the platter in the oven and turn the heat off. This will keep the cod warm when you make the sauce.",
    "Using the same pan, turn the heat to low and add the garlic and a touch more olive oil. Saute until golden ( about 1-2 minutes) then add the capers and cook for 1 minute more.",
    "Add the wine and chicken stock to the pan and turn the heat to high. With a wooden spoon dislodge all of the brown bits from the bottom of the pan. Boil for 2-3 minutes or until the sauce reduces by about half. Turn the heat down to a simmer and add the lemon slices. Simmer the sauce for 2 more minutes.",
    "Roll the butter cubes in the remaining flour and add them to the pan. Using a whisk or wooden spoon, stir the sauce to emulsify. Taste test and adjust salt, pepper, and lemon juice levels if required.",
    "When satisfied with the taste of the sauce, add the parsley to the sauce, then remove the platter from the oven and pour the sauce over the cod fillets. Serve with remaining lemon wedges. Enjoy!"
  ]

}
