{
  "title": "Dal Makhani",
  "ingredients": {
    "To Cook the Lentils": [
      "½ cup whole black lentils (kali urad)",
      "1 tablespoon Bengal gram (chana dal) (optional)",
      "¼ cup red kidney beans (rajma)",
      "4 tablespoons ghee (divided)",
      "2 teaspoons ginger garlic paste",
      "1 teaspoon Kashmiri red chilli powder",
      "½ teaspoon cumin powder",
      "2 teaspoons salt"
    ],
    "To Temper the Lentils": [
      "2 bay leaves",
      "2 whole green cardamoms",
      "2 whole black cardamoms",
      "2 inch piece of cinnamon stick",
      "3-4 whole black peppercorns",
      "3-4 cloves",
      "2-3 whole dry red chilies",
      "1 cup grated onions",
      "6 tablespoons tomato puree",
      "1 teaspoon grated ginger"
    ],
    "For Finishing": [
      "1 teaspoon garam masala",
      "2 tablespoons butter (salted or unsalted)",
      "¼ cup heavy cream",
      "1 tablespoon Kasuri methi"
    ]
  },
  "steps": [
    "Wash whole black lentils, Bengal gram, and red kidney beans with water and soak them together or separately in 3-4 cups of water for 8-10 hours or overnight.",
    "Wash the soaked lentils once again and drain them well.",
    "Add drained lentils to the Instant Pot along with 2 tablespoons ghee, ginger garlic paste, Kashmiri red chili powder, cumin powder, and 2 teaspoons salt.",
    "Add 3 cups of water to the Instant Pot and close the lid.",
    "Set the Instant Pot to PRESSURE COOK on HIGH PRESSURE for 25 minutes. Allow natural pressure release for 10 minutes after cooking, then manually release remaining pressure using a spoon to move the vent safely.",
    "Open the lid and mash the dal with the back of a ladle until creamy. Set aside.",
    "Heat 2 tablespoons ghee in a skillet over high heat.",
    "Lightly crush green cardamoms, black cardamoms, cinnamon, cloves, and black peppercorns in a mortar and pestle.",
    "Add crushed spices, bay leaves, and dry red chilies to the hot ghee. Let them crackle for 4-5 seconds.",
    "Add onions to the skillet and fry until lightly browned (8-10 minutes).",
    "Mix in tomato puree and fry for 2-3 minutes.",
    "Stir in grated ginger and garam masala. Cook for 2 minutes.",
    "Add the cooked and mashed dal to the skillet. Reduce heat to low and simmer for 20-25 minutes, stirring regularly. Add water if too thick, then bring to a boil.",
    "Optional: Discard dry red chilies and bay leaves.",
    "Incorporate butter and heavy cream. Cook for 2 minutes and adjust salt.",
    "Add Kasuri methi and cook for 1 more minute. Garnish with cream and cilantro.",
    "Optional smoking: Place a red-hot coal or cinnamon stick in a bowl atop the dal. Drizzle with oil, cover immediately, and let smoke infuse for 10 minutes before serving."
  ]
}
