{
  "title": "Instant Pot Lobster Bisque",
  "ingredients": {
    "protein": [
      "1/2 pound - 1 pound of lobster meat, chopped into small chunks"
    ],
    "fats_and_dairy": [
      "4 tbsp (1/2 stick) of salted butter, divided",
      "1 pint (2 cups) of heavy cream"
    ],
    "aromatics_and_vegetables": [
      "1 shallot, diced",
      "3 strands of scallions, sliced (use the lower, whiter crunchier part of the scallion)",
      "1 tbsp of crushed garlic"
    ],
    "liquids_and_sauces": [
      "1/4 cup of a dry white wine",
      "2 tsp of Worcestershire sauce",
      "1/2 tsp - 2 tsp of Tabasco sauce (use less for less zest and more for a little more intensity - or don't use any at all if you don't like a hint of spiciness)",
      "1/3 cup of cooking sherry",
      "6 oz can of tomato paste (use 3/4 of the can)",
      "1 cup of Lobster Broth (use 1/2 tbsp of Lobster Better Than Bouillon +1 cup of water)"
    ],
    "spices_and_seasonings": [
      "1 tsp of dried thyme",
      "1/2 tsp of Old Bay seasoning",
      "1 tsp of paprika",
      "2 bay leaves"
    ],
    "garnish": [
      "Oyster crackers, for topping"
    ]
  },
  "steps": [
    "Prepare the lobster meat in one of three ways (A. Boiling two 1 1/4 pound lobsters on the stove for 10 minutes; B. Steaming a lobster tail in your Instant Pot like I did in my Lobster Roll recipe; C. Buying canned lobster meat from a seafood market that carries it). Chop up the meat and set aside when done",
    "Turn the Instant Pot on \"Sauté\" and Adjust\" so it's on \"High\" or \"More\" and melt 1 tbsp of the butter and then add the shallots, scallions and garlic and cook for about a minute",
    "Add in the white wine and deglaze (scrape) the bottom of the pot with a wooden spoon/spatula to remove any remnants that may have stuck to it.",
    "When the wine bubbles (which will be quickly), add the Worcestershire sauce, Tabasco (if using), thyme and Old Bay and cook for another minute",
    "Add the sherry and once it bubbles, add in the lobster broth and paprika",
    "Once that bubbles, add in the tomato paste and stir until it melds into the liquid and it becomes a smooth, thick sauce. Do a final scraping of the bottom of the pan with a wooden spoon/spatula and once it bubbles, add the bay leaves and secure the lid.",
    "Hit \"Cancel\" and then \"Manual\" or \"Pressure Cook\" and set for 2 minutes on High Pressure. The pin will very likely pop up within seconds. Follow with a quick release when done",
    "When the lid is off, hit \"Sauté\" and Adjust\" so it's on \"Medium\" or \"Normal\". Add the rest of the butter and stir it in until it melts, then add in the heavy cream and stir until it's all blended together.",
    "Lastly, add in the lobster meat and immediately hit the \"Keep Warm/Cancel\" button and then keep it on the warm setting. We don't want out lobster meat overcooking so make sure the bubbling of the soup dies down just before adding it in",
    "Serve in some bowls and top with some oyster crackers",
    "Enjoy!"
  ]
}
