{
  "title": "Instant Pot Lamb Stew (Israeli Chili)",
  "ingredients": {
    "Main": [
      "2 tbsp extra virgin olive oil",
      "2 tbsp (1/4 stick) salted butter",
      "1 yellow onion, cut longways into thick slices",
      "1 red onion, cut sideways into strands",
      "2 carrots, peeled and diced",
      "1 tbsp crushed garlic",
      "2 lbs ground lamb (or ground beef, ground pork, ground chicken, or ground turkey)",
      "1 lb chicken thighs, cut into bite-sized chunks (breasts are fine too)",
      "6 oz can tomato paste",
      "1 tbsp paprika",
      "1 tsp turmeric",
      "1 tsp cinnamon",
      "1 tbsp curry powder",
      "1/2 tbsp cumin",
      "2 tsp black pepper",
      "1 tbsp seasoned salt",
      "1/2 tsp cayenne pepper (optional)",
      "1 tsp crushed red pepper flakes (optional)",
      "14.5 oz can diced tomatoes",
      "2 cups chicken broth (or 2 tsp Chicken Better Than Bouillon + 2 cups water)",
      "2 cups garlic broth (or 2 tsp Garlic Better Than Bouillon + 2 cups water, or use 4 cups chicken broth instead)",
      "Juice of 1 lemon",
      "Two 15.5 oz cans chickpeas/garbanzo beans, drained and rinsed",
      "2 cups shredded cabbage (coleslaw mix)",
      "1 cup frozen corn",
      "1 cup crushed tomatoes (not the whole 28 oz can)",
      "1 tsp celery salt",
      "1 tsp garlic salt",
      "1 tsp Italian seasoning",
      "1 tsp dried cilantro"
    ],
    "Toppings (Optional but recommended)": [
      "Tzatziki, dolloped into each bowl",
      "Kosher Dill or sour pickles, diced and placed in each bowl"
    ]
  },
  "steps": [
    "Add the butter and olive oil to the Instant Pot. Set to 'Sauté' on 'More' or 'High.' Once the butter melts and oil bubbles, add red onion, yellow onion, and carrots. Cook for 5 minutes until softened. Add garlic and cook for 1 minute longer.",
    "Add ground lamb and cook until very lightly browned and crumbled. Optionally, ladle out and discard juices or leave them for more flavor. Add chicken pieces, then add paprika, turmeric, cinnamon, curry powder, cumin, seasoned salt, black pepper, cayenne pepper, and crushed red pepper flakes. Stir well to mix spices.",
    "Add tomato paste and stir well. Add chicken broth, garlic broth, lemon juice, diced tomatoes (not crushed tomatoes yet), chickpeas, and cabbage. Stir well, scraping the bottom to deglaze.",
    "Secure the lid. Cancel 'Sauté' and set to 'Manual' or 'Pressure Cook' on High Pressure for 7 minutes. Allow 10–20 minutes for the pot to come to pressure. When done, quick release. Skim off excess fat from the lamb if desired.",
    "Add garlic salt, celery salt, dried cilantro, Italian seasoning, crushed tomatoes, and frozen corn. Stir well and let sit for 2 minutes (the corn will thaw and cook quickly).",
    "Ladle into bowls and top with a dollop of tzatziki and diced dill or sour pickles if using (strongly recommended for authentic flavor). Mix well.",
    "Enjoy!"
  ]
}
