{
  "title": "Instant Pot Lamb Stew (Israeli Chili) - From Scratch",
  "ingredients": {
    "Broth & Prep Foundations": [
      "2 lbs bone-in, skin-on chicken leg quarters",
      "1 head of garlic, halved horizontally",
      "1 onion, halved (skin on)",
      "6 cups water",
      "Generous pinch of salt",
      "1 cup dried chickpeas (yields ~3 cups cooked)",
      "1 fresh ear of sweet corn (kernels sliced off)",
      "4 medium tomatoes, diced (replaces canned diced)",
      "2 large tomatoes, halved and grated (replaces canned crushed)",
      "4 medium tomatoes, grated and simmered into paste (replaces canned paste)"
    ],
    "Main": [
      "2 tbsp extra virgin olive oil",
      "2 tbsp salted butter",
      "1 yellow onion, cut longways into thick slices",
      "1 red onion, cut sideways into strands",
      "2 carrots, peeled and diced",
      "1 rib celery, finely diced",
      "4 cloves fresh garlic, minced",
      "2 lbs ground lamb",
      "Shredded chicken meat (from broth prep)",
      "4 cups homemade Chicken-Garlic Broth (from broth prep)",
      "3 cups cooked chickpeas (from prep)",
      "2 cups shredded cabbage (coleslaw mix)",
      "Juice of 1 lemon"
    ],
    "Seasonings": [
      "Homemade fresh tomato paste (from prep)",
      "1 tbsp paprika",
      "1 tsp turmeric",
      "1 tsp cinnamon",
      "1 tbsp curry powder",
      "1/2 tbsp cumin",
      "2 tsp black pepper",
      "1 tbsp seasoned salt",
      "1/2 tsp cayenne pepper",
      "1 tsp crushed red pepper flakes",
      "1 tsp Italian seasoning",
      "1 tbsp fresh cilantro, chopped"
    ],
    "Toppings (Optional but recommended)": [
      "Tzatziki, dolloped into each bowl",
      "Kosher Dill or sour pickles, diced and placed in each bowl"
    ]
  },
  "steps": [
    "Simmer the chicken quarters, halved head of garlic, halved onion, water, and salt in a large pot for 1.5 hours. Strain the liquid to get 4 cups of broth and pull the meat off the bones.",
    "Soak 1 cup of dried chickpeas overnight, then boil in fresh water for about 1.5 hours until tender.",
    "Prepare the fresh tomatoes: dice 4 medium tomatoes, grate 2 large tomatoes for a crushed texture, and simmer 4 grated medium tomatoes in a skillet with a drop of olive oil for 15–20 minutes until a thick paste forms.",
    "Add the butter and olive oil to the Instant Pot. Set to 'Sauté' on 'More' or 'High.' Once the butter melts and oil bubbles, add the red onion, yellow onion, carrots, and fresh diced celery. Cook for 5 minutes until softened. Add the minced fresh garlic and cook for 1 minute longer.",
    "Add the ground lamb to the pot. Cook until browned, breaking it up with a wooden spoon. Drain excess fat if necessary. Stir in the shredded chicken meat.",
    "Stir in the homemade tomato paste, paprika, turmeric, cinnamon, curry powder, cumin, black pepper, seasoned salt, cayenne, red pepper flakes, and Italian seasoning. Cook for 2 minutes to toast the spices and caramelize the tomato paste.",
    "Pour in a splash of the homemade chicken-garlic broth and scrape the bottom of the pot to remove any browned bits. Add the remaining broth, diced fresh tomatoes, grated tomatoes, lemon juice, and cooked chickpeas.",
    "Secure the lid, ensure the valve is set to 'Sealing,' and cook on Manual/High Pressure for 10 minutes.",
    "Carefully perform a quick release of the pressure. Open the lid and stir in the shredded cabbage, fresh corn kernels, and fresh cilantro. Let it sit on the 'Keep Warm' setting for 5 minutes.",
    "Ladle into bowls and top with Tzatziki and diced kosher dill pickles."
  ]
}
