{
  "title": "Moroccan Chicken Tagine",
  "ingredients": {
    "spices": [
      "2 tsp ground turmeric",
      "2 tsp ground cumin",
      "1 tsp ground coriander",
      "1 tsp salt",
      "½ tsp black pepper"
    ],
    "protein": [
      "8 chicken thighs (skinless and boneless, or with skin and bone, as pictured below)"
    ],
    "fat": [
      "2 Tbsp olive oil"
    ],
    "aromatics_produce": [
      "1 medium red onion, peeled and thinly sliced",
      "3 garlic cloves, minced"
    ],
    "pantry_other": [
      "1½ cups dried brown lentils",
      "½ cup chopped, pitted Medjool dates",
      "½ cup halved, pitted green olives",
      "2 cinnamon sticks",
      "½ cup dry white wine",
      "2 cups chicken broth"
    ],
    "garnish": [
      "1 bunch fresh cilantro, tied together with kitchen string",
      "Snipped cilantro",
      "Lemon wedges"
    ]
  },
  "steps": [
    "Prep the chicken: In a small bowl, combine the turmeric, cumin, coriander, salt and pepper. Mix well. Sprinkle chicken thighs evenly with spice mixture.",
    "Add the oil to the Instant Pot. Select Sauté and adjust to Normal. Working two at a time, brown the thighs on both sides. Transfer the thighs to a plate; set aside.",
    "Add the onion to the oil remaining in the pot; cook and stir for 2 minutes. Add the garlic; cook and stir for 1 minute more. Add lentils, dates, olives, cinnamon sticks, wine, chicken broth and chicken. Place cilantro bundle on top of chicken. Press Cancel.",
    "Secure the lid on the pot. Close the pressure-release valve.",
    "Cook the chicken: Select Meat/Stew and adjust the cook time to Less. When cooking is complete, use a natural release to depressurize.",
    "Serve the chicken: Remove the cilantro bundle and discard. Transfer cooked chicken to a plate. Spoon lentil mixture into a shallow bowl or onto plates; arrange thighs on top of lentils. Sprinkle with snipped cilantro and serve with lemon wedges."
  ]
}
