{
  "Title": "Pan-Seared Salmon With Cherry Tomato Confit",
  "Ingredients": {
    "For the Cherry Tomato Confit": [
      "1½ cups cherry tomatoes (from 1 [10-oz.] pkg.)",
      "3 rosemary sprigs",
      "2 cups extra-virgin olive oil"
    ],
    "For the Salmon": [
      "4 (5- to 6-oz.) skinless salmon fillets",
      "1 tablespoon extra-virgin olive oil"
    ],
    "Seasonings": [
      "1 teaspoon fine sea salt, divided",
      "½ teaspoon black pepper"
    ],
    "For Assembly": [
      "2 tablespoons balsamic vinegar",
      "¼ cup thinly sliced red onion (from 1 small onion)",
      "12 small or 3 large fresh basil leaves, torn",
      "2 oz. Greek feta cheese, crumbled (about ½ cup)"
    ]
  },
  "Steps": [
    "Preheat oven to 250°.",
    "Place tomatoes and rosemary in a large baking dish; sprinkle with ½ teaspoon of the salt. Pour 2 cups of the olive oil over tomatoes.",
    "Bake in oven, uncovered, until tomatoes are softened, wrinkled and slightly burst, about 2 hours. Let cool completely, about 45 minutes. Tomatoes and oil may be stored in an airtight container or jar in refrigerator for up to 6 weeks.",
    "Sprinkle salmon fillets on all sides with pepper and remaining ½ teaspoon salt, pressing to adhere. Heat a large cast-iron skillet over medium. Drizzle remaining 1 tablespoon olive oil evenly in skillet.",
    "Add salmon, and cook until a light crust forms, 4 to 5 minutes. Flip salmon, and cook until an instant-read thermometer inserted into thickest portion of fish registers 120°, 3 to 4 minutes.",
    "Transfer salmon to plates, and let rest for 5 minutes. (Temperature will continue to rise to 125°.)",
    "Using a slotted spoon, gently transfer tomatoes to a small bowl, reserving oil in container. Spoon 7 to 8 tomatoes around each salmon fillet; drizzle each with 1 teaspoon reserved oil and ½ tablespoon of the balsamic vinegar.",
    "Top each with sliced onion, basil and 2 tablespoons feta. Serve immediately."
  ],
  "ServingInfo": {
    "Serves": 4,
    "ActiveTime": "15 minutes",
    "TotalTime": "3 hours, 5 minutes"
  }
}
