{
  "title": "Salmon Stuffed with Leeks",
  "ingredients": {
    "Proteins_and_Produce": [
      "1 whole salmon fillet, about 1 1/2 pounds",
      "2 medium leeks"
    ],
    "For_Cooking_Leeks": [
      "1 tablespoons olive oil",
      "1 tablespoons butter",
      "Salt & pepper (to taste for leeks)"
    ],
    "Marinade": [
      "1 lemon, zested & juiced",
      "1 Tablespoon soy sauce",
      "1 Tablespoon olive oil",
      "1 clove garlic"
    ],
    "Garnish": [
      "Bunch of fresh dill",
      "1 lemon, sliced",
      "Pine nuts, toasted (optional)"
    ]
  },
  "steps": [
    "Roughly chop leeks into 1/4 inch rounds. Wash thoroughly and drain well.",
    "In a large, heavy-bottomed pot, melt the butter and 1 tablespoon of olive oil over medium heat. Add the chopped leeks and sauté gently until very soft, about 20 minutes. Be careful not to let them brown. Season with salt and pepper. Once cooked, remove from heat and let the leek mixture cool to lukewarm.",
    "Preheat oven to 350°F (175°C).",
    "Prepare the salmon: Place the salmon fillet on a large cutting board. With a sharp knife, carefully cut a pocket horizontally along the length of the fillet. Cut deep into the center but not all the way through, creating an opening similar to a sub sandwich.",
    "Line a baking sheet with parchment paper. Place the salmon fillet on the prepared baking sheet and gently open the pocket by folding back the top layer of the fillet.",
    "In a small bowl, prepare the marinade: combine the juice and zest of 1 lemon, 1 Tablespoon of soy sauce, and 1 Tablespoon of olive oil. Using a microplane or fine grater, grate the 1 clove of garlic directly into the bowl. Stir the mixture well.",
    "Brush a portion of the marinade all over the salmon fillet, ensuring to coat the inside of the pocket as well as the outer surfaces. Reserve some marinade for later.",
    "Spread the cooled leek mixture evenly inside the bottom half of the salmon pocket. Fold the top layer of the salmon back down to cover the leeks, enclosing the stuffing.",
    "Spread the remaining marinade over the top surface of the stuffed salmon.",
    "Bake in the preheated oven for about 15-18 minutes, or until the salmon is cooked through and flakes easily with a fork.",
    "Once cooked, carefully transfer the stuffed salmon to a serving platter using two sturdy spatulas.",
    "Garnish with a bunch of fresh dill, freshly sliced lemon, and toasted pine nuts (if using). This dish is noted to be enjoyed with a side of couscous."
  ]
}
