{
  "title": "Scallops with Brussels Sprouts & Bacon",
  "ingredients": {
    "produce": [
      "12 brussels sprouts, trimmed and quartered lengthwise",
      "Lemon wedges for serving (optional)"
    ],
    "protein": [
      "4 bacon slices (optional)",
      "12 sea scallops"
    ],
    "pantry": [
      "1 1/2 tsp. salt",
      "1 1/2 tsp. freshly ground pepper",
      "1/4 cup cornstarch",
      "2 Tbs. fresh lemon juice",
      "2 Tbs. dry white wine",
      "Extra-virgin olive oil for serving (optional)"
    ],
    "dairy_and_fats": [
      "2 tsp. unsalted butter",
      "2 tsp. olive oil"
    ]
  },
  "steps": [
    "Bring a large saucepan of salted water to a boil over high heat. Add the brussels sprouts and cook until barely tender. Drain and rinse under cold water to stop the cooking.",
    "Meanwhile, in a fry pan over medium heat, cook the bacon, turning occasionally, until crisp. Transfer to paper towels to drain. Pour off all but 2 tsp. of the rendered fat from the pan.",
    "Return the fry pan to medium-high heat. Add the brussels sprouts and sauté until the edges are golden, about 5 minutes. Season with 1 tsp. each of the salt and pepper. Remove from the heat and cover to keep warm.",
    "Pat the scallops dry with paper towels. On a plate, stir together the cornstarch and the remaining 1/2 tsp. each salt and pepper. Roll the scallops in the cornstarch mixture to coat lightly.",
    "In a fry pan over medium-high heat, melt the butter with the olive oil. Add the scallops and sear for 3 minutes. Turn the scallops over and sear for 1 minute. Add the 2 Tbs. lemon juice, wine and 2 Tbs. water and stir to scrape up the browned bits. Cover, reduce the heat to low and cook until scallops are just opaque throughout, 2 to 3 minutes.",
    "Divide the brussels sprouts among 4 bowls. Top each serving with 3 scallops and drizzle with the pan juices. Crumble the bacon and sprinkle over the sprouts, or drizzle with lemon juice and olive oil. Serve hot."
  ]
}
