{
  "title": "Shawarma-Spiced Roasted Cauliflower",
  "ingredients": {
    "Shawarma-Spiced Cauliflower": [
      "2 small heads cauliflower (1 ½ to 2 pounds each)",
      "1 teaspoon ground cumin",
      "1 teaspoon ground coriander",
      "1 teaspoon smoked paprika",
      "1 teaspoon ground turmeric",
      "1 teaspoon Diamond Crystal kosher salt",
      "1 teaspoon freshly ground black pepper",
      "½ teaspoon ground cinnamon",
      "½ teaspoon cayenne pepper",
      "½ cup extra-virgin olive oil"
    ],
    "Garlicky Tahini": [
      "¼ cup well-stirred tahini",
      "2 large garlic cloves, minced or grated",
      "Juice of ½ large lemon",
      "2 tablespoons cold water or 2 to 3 ice cubes",
      "Kosher salt and freshly ground black pepper"
    ],
    "Quick-Pickled Onions": [
      "½ small red onion, thinly sliced",
      "1 tablespoon extra-virgin olive oil",
      "½ teaspoon toasted sesame seeds, plus more for sprinkling",
      "Juice of ½ large lemon",
      "¼ cup roughly torn fresh dill",
      "Kosher salt"
    ]
  },
  "steps": [
    "Preheat your oven to 400°F. Line a sheet pan with parchment paper.",
    "Cut away the green leaves and stem from the cauliflower, leaving the core intact. In a steamer basket or a wide deep pot, bring a few inches of water to a boil. Add your cauliflower and steam over medium-high heat until the cauliflower is crisp-tender, 8 to 10 minutes. You should be able to easily pierce it with the tip of a paring knife.",
    "Meanwhile, in a large bowl, combine the cumin, coriander, paprika, turmeric, salt, black pepper, cinnamon, and cayenne. Mix well, then stir in the olive oil.",
    "One at a time, use tongs to carefully transfer each steamed head of cauliflower to the bowl of spice rub. Let sit to cool for 5 minutes, then turn to coat all sides. Transfer the cauliflower to the lined sheet pan. Spoon the rest of the spice rub over both.",
    "Transfer to the oven and roast until the cauliflower is completely tender and a golden crust forms on the outside, 30 to 40 minutes.",
    "While your cauliflower is in the oven, in a small bowl, whisk together the tahini, garlic, lemon juice, cold water or ice cubes, and pinch of each of salt and black pepper. Stir well to combine. If the mixture is too thick, add more ice or water as needed.",
    "In the bowl used for the spice rub, combine the red onion, olive oil, sesame seeds, lemon juice, dill, and salt to taste. Toss to combine and let sit until serving time.",
    "Once the cauliflower is done, transfer it to a serving platter. Drizzle the garlic tahini over the cauliflower. Sprinkle with toasted sesame seeds and your quick-pickled onions. Serve the cauliflower whole, or slice it into wedges."
  ]
}
