{
  "title": "Ultimate Instant Pot Thai Chicken Curry",
  "ingredients": {
    "Aromatics & Base": [
      "1 tablespoon vegetable oil (or olive/avocado oil)",
      "1 medium onion, peeled and thinly sliced (or diced)",
      "3-4 cloves garlic, minced or crushed",
      "1-inch piece of ginger, peeled and grated or crushed",
      "1/2 teaspoon fine sea salt (for sautéing aromatics)",
      "Cream from the top of 1-2 (13.5 ounce) cans of unsweetened coconut milk (do not shake cans)",
      "1/4 to 1/2 cup Thai curry paste (Yellow is predominant in your files, but Green is an option. Maesri brand suggested for 1/2 cup being a 4oz can)"
    ],
    "Protein": [
      "1.5 - 3 pounds boneless, skinless chicken breasts, cut into 1-inch cubes (Option: use chicken thighs, increase pressure cooking time to 8-10 minutes)",
      "1/2 - 3/4 teaspoon fine sea salt (for chicken)"
    ],
    "Vegetables": [
      "Choose a combination, about 3-4 cups total:",
      "1 - 1.5 pounds potatoes (Petite Yukon Gold or red), quartered",
      "1-2 medium red bell peppers, trimmed, seeded, and cut into strips or diced",
      "1 green bell pepper, diced",
      "1-2 medium zucchini, cut into 1/2-inch thick half-moons",
      "1 diced eggplant",
      "1/2 cup sliced bamboo shoots (optional)",
      "Snow peas (add during the \"Finish the Curry\" step)"
    ],
    "Sauce & Seasonings": [
      "Liquid from the 1-2 cans of coconut milk",
      "1/2 cup chicken broth (optional, for a thinner sauce if using less coconut milk)",
      "1-2 tablespoons fish sauce (plus more to taste)",
      "1-2 tablespoons soy sauce (plus more to taste)",
      "1 tablespoon brown sugar (plus more to taste)",
      "Juice of 1 lime"
    ],
    "Optional Flavor Boosters": [
      "1-2 teaspoons curry powder",
      "1 teaspoon coriander powder",
      "1/2 teaspoon cumin powder",
      "1/2 teaspoon dried basil",
      "1 small diced red chili pepper or 1-2 tsp crushed red pepper (for extra heat)",
      "Lime zest (from the lime used for juice)"
    ],
    "Garnish & Sides": [
      "Minced fresh cilantro",
      "Minced fresh Thai basil (or regular basil)",
      "Lime wedges",
      "Jasmine rice, for serving"
    ]
  },
  "steps": [
    "Set your Instant Pot to \"Sauté\" mode on high. Heat the vegetable oil until shimmering.",
    "Add the onion, bell peppers (if using tougher ones like standard bell peppers), garlic, and ginger. Sprinkle with 1/2 teaspoon of salt. Sauté, stirring occasionally, until the onion starts to soften, about 3-4 minutes. If using optional chili/crushed red pepper and lime zest, add them now and stir for 1 minute.",
    "Scoop the thick cream from the top of the coconut milk can(s) into the pot. Add the curry paste (yellow or green) and the optional curry powder, coriander powder, cumin powder, and dried basil if using.",
    "Cook, stirring often, until the curry paste darkens slightly and the oil starts to separate from the coconut cream, about 3-5 minutes. This step is crucial for flavor.",
    "Add the cubed chicken to the pot and sprinkle with 1/2 - 3/4 teaspoon salt. Stir to coat the chicken with the curry paste mixture.",
    "Stir in the potatoes (and other firm vegetables like diced eggplant or bamboo shoots, if using).",
    "Pour in the reserved liquid coconut milk and chicken broth (if using). Add the fish sauce, soy sauce, and brown sugar. Stir everything well, scraping the bottom of the pot to loosen any browned bits.",
    "Press \"Cancel.\" Secure the lid and set the Instant Pot to \"Pressure Cook\" (or \"Manual\") on High Pressure for 5-6 minutes for chicken breast (or 8-10 minutes for chicken thighs).",
    "Once the cooking time is complete, allow a 5-10 minute Natural Pressure Release, then perform a Quick Release to vent any remaining steam.",
    "Carefully remove the lid. Select \"Sauté\" mode again and adjust to high or medium-high.",
    "Stir in the lime juice and any tender vegetables you're using (like zucchini, snow peas, or pre-diced bell peppers if you prefer them crisper).",
    "Simmer for 3-8 minutes, or until the tender vegetables are crisp-tender and the sauce has slightly thickened.",
    "Taste the curry and adjust seasonings as needed. Add more fish sauce or soy sauce for saltiness/umami, more brown sugar for sweetness, or more lime juice for brightness.",
    "Ladle the curry into bowls over Jasmine rice. Garnish generously with minced cilantro and Thai basil, and serve with extra lime wedges on the side."
  ]
}