{
  "title": "Ultimate Induction Stovetop Thai Chicken Curry",
  "ingredients": {
    "Aromatics & Base": [
      "1 tablespoon vegetable oil (or olive/avocado oil)",
      "1 medium onion, peeled and thinly sliced (or diced)",
      "3-4 cloves garlic, minced or crushed",
      "1-inch piece of ginger, peeled and grated or crushed",
      "1/2 teaspoon fine sea salt (for sautéing aromatics)",
      "Cream from the top of 1-2 (13.5 ounce) cans of unsweetened coconut milk (do not shake cans)",
      "1/4 to 1/2 cup Thai curry paste (Yellow is common in your files, but Green is an option. Maesri brand suggested for 1/2 cup being a 4oz can)"
    ],
    "Protein": [
      "1.5 - 3 pounds boneless, skinless chicken breasts or thighs, cut into 1-inch cubes",
      "1/2 - 3/4 teaspoon fine sea salt (for chicken)"
    ],
    "Vegetables": [
      "Choose a combination, about 3-4 cups total:",
      "1 - 1.5 pounds potatoes (Petite Yukon Gold or red), peeled and cut into 1-inch cubes",
      "1-2 medium red bell peppers, trimmed, seeded, and cut into strips or diced",
      "1 green bell pepper, diced (optional)",
      "1-2 medium zucchini, cut into 1/2-inch thick half-moons",
      "1 diced eggplant (optional)",
      "1/2 cup sliced bamboo shoots (optional)",
      "1 cup snow peas (optional)"
    ],
    "Sauce & Seasonings": [
      "Liquid from the 1-2 cans of coconut milk",
      "1/2 - 1 cup chicken broth (use more if needed for simmering)",
      "1-2 tablespoons fish sauce (plus more to taste)",
      "1-2 tablespoons soy sauce (plus more to taste)",
      "1 tablespoon brown sugar (plus more to taste)",
      "Juice of 1 lime"
    ],
    "Optional Flavor Boosters": [
      "1-2 teaspoons curry powder",
      "1 teaspoon coriander powder",
      "1/2 teaspoon cumin powder",
      "1/2 teaspoon dried basil",
      "1 small diced red chili pepper or 1-2 tsp crushed red pepper (for extra heat)",
      "Lime zest (from the lime used for juice)"
    ],
    "Garnish & Sides": [
      "Minced fresh cilantro",
      "Minced fresh Thai basil (or regular basil)",
      "Lime wedges",
      "Jasmine rice, for serving"
    ]
  },
  "steps": [
    "Prepare Ingredients: Have all your vegetables chopped, aromatics minced/grated, chicken cubed, and cans opened. This makes the stovetop process smoother.",
    "Sauté Aromatics: Place a large, heavy-bottomed pot or Dutch oven (induction compatible) over medium heat on your induction stovetop. Add the vegetable oil.",
    "Once the oil is shimmering, add the onion, 1/2 teaspoon salt, and cook, stirring occasionally, until softened, about 5-7 minutes.",
    "Add the garlic, ginger, and optional fresh chili/crushed red pepper and lime zest. Cook for another 1-2 minutes until fragrant, stirring constantly to prevent burning.",
    "Fry the Curry Paste: Add the thick coconut cream scooped from the top of the can(s) to the pot. Stir in the Thai curry paste and optional powdered spices (curry powder, coriander, cumin, dried basil).",
    "Cook over medium heat, stirring frequently, for 3-5 minutes. The paste should darken slightly, become very fragrant, and you might see some oil separation.",
    "Build the Curry & Simmer: Add the cubed chicken to the pot and sprinkle with its portion of salt. Stir to coat the chicken with the curry paste mixture. Cook for 2-3 minutes, stirring, until the chicken is lightly seared on the outside.",
    "Add the cubed potatoes, the remaining liquid coconut milk, and chicken broth. Stir in the fish sauce, soy sauce, and brown sugar.",
    "Bring the mixture to a gentle simmer. Once simmering, reduce the heat to low or medium-low to maintain a gentle simmer (avoid a rolling boil). Cover the pot.",
    "Cook for 15-20 minutes, or until the potatoes are nearly tender and the chicken is cooked through. Stir occasionally to prevent sticking.",
    "Add Remaining Vegetables: Stir in the firmer vegetables you're using (like bell peppers, eggplant, bamboo shoots). Continue to simmer, covered, for another 10-15 minutes, or until these vegetables are tender-crisp and potatoes are fully cooked.",
    "If using quick-cooking vegetables like zucchini or snow peas, add them in the last 5-8 minutes of cooking to ensure they remain crisp-tender.",
    "Finish & Serve: Turn off the heat. Stir in the fresh lime juice.",
    "Taste the curry. Adjust seasonings if needed: more fish sauce/soy sauce for saltiness, brown sugar for sweetness, or lime juice for tang.",
    "Ladle the curry into bowls over hot Jasmine rice. Garnish generously with minced fresh cilantro, Thai basil, and serve with extra lime wedges on the side."
  ]
}